INSERT INTO KHOA VALUES
('CNTT','Công nghệ Thông tin','Nguyễn Văn A'),
('CK','Cơ khí','Trần Văn B'),
('DT','Điện tử','Lê Văn C');
INSERT INTO LOP VALUES
('21CDT1','Công nghệ 1','CNTT'),
('21CDT2','Công nghệ 2','CNTT'),
('21CK1','Cơ khí 1','CK'),
('21DT1','Điện tử 1','DT');
INSERT INTO SINHVIEN VALUES
('SV01','Nguyễn An','21CDT1',2003),
('SV02','Trần Bình','21CDT1',2004),
('SV03','Lê Cường','21CDT1',2003),

('SV04','Phạm Dũng','21CDT2',2002),
('SV05','Hoàng Em','21CDT2',2004),

('SV06','Đặng Phúc','21CK1',2003),
('SV07','Võ Giang','21DT1',2002);
INSERT INTO MONHOC VALUES
('MH01','Cơ sở dữ liệu',3),
('MH02','Lập trình C',4),
('MH03','Toán rời rạc',3),
('MH04','Tiếng Anh',2),
('MH05','Mạng máy tính',3);
INSERT INTO KETQUA VALUES

-- ===================
-- SV01 thi tất cả
-- ===================
('SV01','MH01',9),
('SV01','MH02',8),
('SV01','MH03',8),
('SV01','MH04',7),
('SV01','MH05',9),

-- ===================
-- SV02 thiếu MH05
-- ===================
('SV02','MH01',5),
('SV02','MH02',4),
('SV02','MH03',6),
('SV02','MH04',8),

-- ===================
-- SV03 thiếu MH04
-- ===================
('SV03','MH01',8),
('SV03','MH02',9),
('SV03','MH03',9),
('SV03','MH05',10),

-- ===================
-- SV04
-- ===================
('SV04','MH01',9),
('SV04','MH02',9),
('SV04','MH03',9),
('SV04','MH04',9),
('SV04','MH05',9),

-- ===================
-- SV05
-- ===================
('SV05','MH01',2),
('SV05','MH02',3),
('SV05','MH03',4),

-- ===================
-- SV06
-- ===================
('SV06','MH01',6),
('SV06','MH03',7),
('SV06','MH05',8),

-- ===================
-- SV07
-- ===================
('SV07','MH01',8),
('SV07','MH02',9),
('SV07','MH05',7);
